# Definition Properties

---
The Definition type exposes the following members.
| Name| Description
---|---|---
| Name| The user visible name for the parameter.
Top
#### Reference
Definition Class
Autodesk.Revit.DB Namespace